index=sysmon Image="*"
`comment("This alert detect new system processes which have not been seen before. Category:Anomalous ")`
| eval image=lower(Image)
| rex field=Image "(?P<Image>[^\\\]+)$"
| fields image | dedup image | table image
| search NOT [inputlookup baseline_sysmon_image.csv | table image] 
| outputlookup append=true create_empty=true output_format=splunk_sv_csv baseline_sysmon_image.csv
